app/views/devise/registrations/edit.html.erb

    <%= f.label :zodiac_id %><br />
    <%= f.collection_select(:zodiac_id, Zodiac.all, :id, :sign) %>
---
SELECT "zodiacs".* FROM "zodiacs"