app/views/devise/registrations/new.html.erb

    <%= f.label :zodiac_id %><br />
    <%= f.collection_select(:zodiac_id, Zodiac.all, :id, :sign, include_blank: true) %>
---
SELECT "zodiacs".* FROM "zodiacs"