app/controllers/home_controller.rb

  def index
    @zodiacs = Zodiac.all
---
SELECT "zodiacs".* FROM "zodiacs"