app/controllers/journals_controller.rb

  def index
    if current_user
      @journals = Journal.where(user_id: current_user.id)
---
SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = ?  [["user_id", 5]]

  def show
    if current_user
      @journal=Journal.where(user_id: current_user.id).last
---
SELECT "journals".* FROM "journals" WHERE "journals"."user_id" = ?  [["user_id", 7]]

  def new
    @params=journal_params.inspect
    if @params.user_id.nil?
      @user = User.find(journal_params[:user_id])
        else
      @user = User.find(params[:user_id])
    end
    if current_user
      @predict = Predict.find(my_pred)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "predicts".* FROM "predicts" WHERE (zodiac_id =NULL and created_at > '2017-08-11 04:00:00') ORDER BY "predicts"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    @user = User.find(params[:user_id])
    @journal=@user.journals.build(journal_params)
    if current_user
      if @journal.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
INSERT INTO "journals" ("user_id", "predict_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["predict_id", 15], ["comment", "yes I see that"], ["created_at", 2017-08-15 01:35:07 UTC], ["updated_at", 2017-08-15 01:35:07 UTC]]