app/controllers/zodiacs_controller.rb

SELECT "zodiacs".* FROM "zodiacs"
---
  def index
    @zodiacs = Zodiac.all

SELECT  "predicts".* FROM "predicts" WHERE (zodiac_id =1 and created_at > '2017-08-12 04:00:00') ORDER BY "predicts"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "zodiacs".* FROM "zodiacs" WHERE "zodiacs"."sign" = ? ORDER BY "zodiacs"."id" ASC LIMIT ?  [["sign", "Aries"], ["LIMIT", 1]]
---
  def show
    # puts params.inspect
    # fine the latest (today's) prediction associated with the zodiac sign passed
    @prediction = Predict.where("zodiac_id =? and created_at > ?", get_sign, Time.now.midnight).last
    @sign=Zodiac.find(get_sign).sign